       IDENTIFICATION DIVISION.
       PROGRAM-ID. INDEXBY.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-STR-TABLE.
          05 WS-PRODUCT OCCURS 3 TIMES INDEXED BY IDX.
             10 WS-ITEM-CODE   PIC 9(05).
       01 WS-ITEM-VAL PIC 9(05)  VALUE 12345.
       01 WS-COUNTER PIC 9(01) VALUE 1.
       PROCEDURE DIVISION.
           SET IDX TO 1.
           MOVE WS-ITEM-VAL TO WS-ITEM-CODE(IDX).
           PERFORM PROD-DETAILS UNTIL > 3.
            STOP RUN.
       PROD-DETAILS.
           DISPLAY "PRODUCT " WS-COUNTER " " WS-ITEM-CODE(IDX).
           ADD 1 TO WS-ITEM-VAL.
           ADD 1 TO WS-COUNTER.
           SET IDX UP BY 1.
