       IDENTIFICATION DIVISION.
       PROGRAM-ID. SEARCHAL.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-STR-TABLE.
          05 WS-PRODUCT OCCURS 3 TIMES ASCENDING KEY IS
                   WS-ITEM-CODE INDEXED BY IDX.
             10 WS-ITEM-CODE   PIC 9(05).
       01 WS-ITEM-VAL PIC 9(05)  VALUE 12345.
       01 WS-COUNTER PIC 9(01) VALUE 1.
       PROCEDURE DIVISION.
           SET IDX TO 1.
           PERFORM PROD-DETAILS UNTIL > 3.
           PERFORM SEARCH-ALL-PARA.
            STOP RUN.
       PROD-DETAILS.
           MOVE WS-ITEM-VAL TO WS-ITEM-CODE(IDX).
           DISPLAY "PRODUCT " WS-COUNTER " " WS-ITEM-CODE(IDX).
           ADD 1 TO WS-ITEM-VAL.
           ADD 1 TO WS-COUNTER.
           SET IDX UP BY 1.
       SEARCH-ALL-PARA.
           SEARCH ALL WS-PRODUCT
              AT END DISPLAY "RECORD NOT FOUND"
              WHEN WS-ITEM-CODE(IDX) = 12346
                DISPLAY "RECORD FOUND"
                DISPLAY WS-ITEM-CODE(IDX)
           END-SEARCH.
