       IDENTIFICATION DIVISION.
       PROGRAM-ID. SUBSCR.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-STR-TABLE.
          05 WS-PRODUCT OCCURS 3 TIMES.
             10 WS-ITEM-CODE   PIC 9(05).
       01 WS-ITEM-VAL PIC 9(05)  VALUE 12345.
       01 WS-SUB PIC 9(01).
       PROCEDURE DIVISION.
           MOVE 1 TO WS-SUB.
           PERFORM PROD-DETAILS UNTIL WS-SUB > 3.
            STOP RUN.
       PROD-DETAILS.
           MOVE WS-ITEM-VAL TO WS-ITEM-CODE(WS-SUB).
           DISPLAY "PRODUCT " WS-SUB " " WS-ITEM-CODE(WS-SUB).
           ADD 1 TO WS-ITEM-VAL.
           ADD 1 TO WS-SUB.
