       IDENTIFICATION DIVISION.
       PROGRAM-ID. TWODTABL.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-STORE-PROD-TABLE.
          05 WS-STORE-ID OCCURS 3 TIMES.
            10 WS-PRODUCT OCCURS 5 TIMES PIC 9(08).
       01 WS-TIME PIC 9(08).
       01 I  PIC 9(01).
       01 J  PIC 9(01).
       PROCEDURE DIVISION.
           ACCEPT WS-TIME FROM TIME.
           DISPLAY " THIS IS 2 D TABLE".
           PERFORM PRODUCT-PARA VARYING I FROM 1 BY 1 UNTIL I > 3
            AFTER J FROM 1 BY 1 UNTIL J > 5.
            STOP RUN.
       PRODUCT-PARA.
           MOVE WS-TIME TO WS-PRODUCT(I, J).
           DISPLAY "PRODUCT" I "," J " "
                  WS-PRODUCT(I, J).
           ADD  1 TO WS-TIME.
